# https://python-book.softuni.bg/chapter-02-simple-calculations-exam-problems.html#%D0%B7%D0%B0%D0%B4%D0%B0%D1%87%D0%B0-%D1%80%D0%B5%D0%BC%D0%BE%D0%BD%D1%82-%D0%BD%D0%B0-%D0%BF%D0%BB%D0%BE%D1%87%D0%BA%D0%B8

# Задача: ремонт на плочки
# На площадката пред жилищен блок трябва да се поставят плочки.
# Площадката е с форма на квадрат със страна N метра. Плочките са широки „W“ метра и дълги „L“ метра.
# На площадката има една пейка с ширина M метра и дължина O метра. Под нея не е нужно да се слагат плочки.
# Всяка плочка се поставя за 0.2 минути.
#
# Напишете програма, която чете от конзолата размерите на площадката, плочките и пейката
# и пресмята колко плочки са необходими да се покрие площадката
# и пресмята времето за поставяне на всички плочки.
#
# Пример:
# площадка с размер 20 м.
# има площ 400 кв.м.
# Пейка, широка 1 м. и дълга 2 м., заема площ 2 кв.м.
# Една плочка е широка 5 м. и дълга 4 м. и има площ = 20 кв.м.
# Площта, която трябва да се покрие, е 400 – 2 = 398 кв.м.
# Необходими са 398 / 20 = 19.90 плочки. Необходимото време е 19.90 * 0.2 = 3.98 минути.
#
# Входни данни
# От конзолата се четат 5 числа:
#
# N – дължината на страна от площадката в интервала [1 … 100].
# W – широчината на една плочка в интервала [0.1 … 10.00].
# L – дължината на една плочка в интервала [0.1 … 10.00].
# М – широчината на пейката в интервала [0 … 10].
# О – дължината на пейката в интервала [0 … 10].
#
# Изходни данни
# Да се отпечатат на конзолата две числа:
#
# броя плочки, необходим за ремонта
# времето за поставяне
# Всяко число да бъде на нов ред и закръглено до втория знак след десетичната запетая.


